#Step1

In [1]:
import pandas as sheida_panda

#Step2

In [4]:
Table= sheida_panda.DataFrame(["A","B","C"])

#Step3

In [5]:
Table

   0
0  A
1  B
2  C

In [15]:
Table2= sheida_panda.DataFrame(List_name)

In [18]:
Table= sheida_panda.DataFrame(["A","B","C"] ,columns=["name"])

In [19]:
Table

  name
0    A
1    B
2    C

In [20]:
List_name= ["A","B","C"]

In [21]:
Table2= sheida_panda.DataFrame(List_name)

In [22]:
Table2

   0
0  A
1  B
2  C

In [23]:
Table3= sheida_panda.DataFrame(List_name,columns=["name"])

In [24]:
Table3

  name
0    A
1    B
2    C

In [26]:
List_name2= [["A","B","C"],[1, 2, 3]]

In [28]:
Table3= sheida_panda.DataFrame(List_name2)

In [29]:
Table3

   0  1  2
0  A  B  C
1  1  2  3

In [33]:
List_name4= [("A",1),("B",2),("C",3)]

In [34]:
Table4= sheida_panda.DataFrame(List_name4)

In [35]:
Table4

   0  1
0  A  1
1  B  2
2  C  3

In [38]:
Table5= sheida_panda.DataFrame(List_name4,columns =["Name","Age"])

In [39]:
Table5

  Name  Age
0    A    1
1    B    2
2    C    3

#bringing CSV

In [45]:
titanic_train= sheida_panda.read_csv("titanic_train.csv")

In [46]:
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [48]:
List_name5= [("A",1,"F"),
             ("B",2,"m"),
             ("C",3, "f")]

In [49]:
Table5= sheida_panda.DataFrame(List_name5)

In [50]:
Table5

   0  1  2
0  A  1  F
1  B  2  m
2  C  3  f

In [51]:
Table6= sheida_panda.DataFrame(List_name5,columns =["Name","Age","gender"])

In [52]:
Table6

  Name  Age gender
0    A    1      F
1    B    2      m
2    C    3      f

In [53]:
titanic_train= sheida_panda.read_csv("titanic_train.csv")

In [55]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [56]:
titanic_train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [57]:
titanic_train.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
196,197,0,3,"Mernagh, Mr. Robert",male,NaN,0,0,368703,7.75,NaN,Q

In [58]:
titanic_train.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
623,624,0,3,"Hansen, Mr. Henry Damsgaard",male,21.0,0,0,350029,7.8542,NaN,S
795,796,0,2,"Otter, Mr. Richard",male,39.0,0,0,28213,13.0000,NaN,S
592,593,0,3,"Elsbury, Mr. William James",male,47.0,0,0,A/5 3902,7.2500,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
805,806,0,3,"Johansson, Mr. Karl Johan",male,31.0,0,0,347063,7.7750,NaN,S

In [59]:
titanic_train.sample(5,random_state=23)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
727,728,1,3,"Mannion, Miss. Margareth",female,NaN,0,0,36866,7.7375,NaN,Q
668,669,0,3,"Cook, Mr. Jacob",male,43.0,0,0,A/5 3536,8.0500,NaN,S
210,211,0,3,"Ali, Mr. Ahmed",male,24.0,0,0,SOTON/O.Q. 3101311,7.0500,NaN,S
654,655,0,3,"Hegarty, Miss. Hanora ""Nora""",female,18.0,0,0,365226,6.7500,NaN,Q
228,229,0,2,"Fahlstrom, Mr. Arne Jonas",male,18.0,0,0,236171,13.0000,NaN,S

In [60]:
titanic_train.sample(5,random_state=23)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
727,728,1,3,"Mannion, Miss. Margareth",female,NaN,0,0,36866,7.7375,NaN,Q
668,669,0,3,"Cook, Mr. Jacob",male,43.0,0,0,A/5 3536,8.0500,NaN,S
210,211,0,3,"Ali, Mr. Ahmed",male,24.0,0,0,SOTON/O.Q. 3101311,7.0500,NaN,S
654,655,0,3,"Hegarty, Miss. Hanora ""Nora""",female,18.0,0,0,365226,6.7500,NaN,Q
228,229,0,2,"Fahlstrom, Mr. Arne Jonas",male,18.0,0,0,236171,13.0000,NaN,S